КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/КонтурЛогистика_НастройкиПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПодписания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдалитьОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>Используется только если не настроена должность в сертификате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьМЧД</name>
    <comment>Единый регистрационный номер доверенности, Уникальный идентификатор доверенности в виде 36-разрядного GUID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИдСистХран</name>
    <comment>ИдСистХран - Идентифицирующие сведения об информационной системе, в которой хранится доверенность, используемая для подтверждения полномочий в электронной форме (СвСистХран для некоторых сообщений)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатусПодписанта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИздатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыпускаМЧД</name>
    <comment>в драфте 5.02 более нет необходимости указывать дату доверки в титуле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ДатаДовер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ВнНомДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СертификатыЭлектроннойПодписи</types>
    </type>
  </resources>
  <resources>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_МЧД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатБезМЧД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСведенияОПодписанте</name>
    <comment>Дополнительные сведения о подписанте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСпособПодтвержденияПолномочий</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>ИсключениеДляОтдельныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>taskIdRegisterPOA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНастройки</name>
    <comment>Для метрик</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <comment>не заполнен - общее значение для организации</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛиц/КонтурЛогистика_ТипыЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛиц</name>
  <enumValues>
    <name>ИП</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ОрганИсполнительнойВласти</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий/КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий</name>
  <enumValues>
    <name>МЧД</name>
  </enumValues>
  <enumValues>
    <name>БумажнаяДоверенность</name>
  </enumValues>
  <enumValues>
    <name>БезДоверенности</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_СертификатыЭлектроннойПодписи/КонтурЛогистика_СертификатыЭлектроннойПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_СертификатыЭлектроннойПодписи</name>
  <attributes>
    <name>ОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСертификата</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиТипаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВладельцаСертификата</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатВыдан</name>
    <comment>Кому выдан сертификат: ЮЛ, ФЛ, ИП</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВыбратьПодписанта(ОрганизацияДиадок, Пользователь1С = Неопределено, 
	ДатаПодписи = Неопределено, ДокументОбъектИлиСсылка = Неопределено, ДопПараметр = Неопределено) Экспорт
	
	Если ДатаПодписи = Неопределено Тогда
		ДатаПодписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Кастомизировать особенности выбора сертификата через ПМ:
	// установить ДопПараметр равный тому что в регистре КонтурЛогистика_НастройкиПодписания
	ДопПараметрПМ = КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ВыбратьПодписанта_ДопПараметр",
		Истина,
		ДокументОбъектИлиСсылка);
	
	Если ЗначениеЗаполнено(ДопПараметрПМ) Тогда
		ТекущийДопПараметр = ДопПараметрПМ;
	Иначе
		ТекущийДопПараметр = ДопПараметр;
	КонецЕсли;
		
	// ПМ замена механизма
	СтандартнаяОбработка = Истина;
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("ОрганизацияДиадок", ОрганизацияДиадок);
	ПараметрыПМ.Вставить("ДатаПодписи", ДатаПодписи);
	ПараметрыПМ.Вставить("ДокументОбъектИлиСсылка", ДокументОбъектИлиСсылка);
	ПараметрыПМ.Вставить("ДопПараметр", ДопПараметр);
	РезультатПМ = КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ВыбратьПодписанта_ЗаменаМеханизма", СтандартнаяОбработка, ПараметрыПМ);
					
	Если СтандартнаяОбработка = Ложь Тогда		
		Возврат РезультатПМ;		
	КонецЕсли;
	
	Результат = МанифестПодписант();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок КАК ОрганизацияДиадок,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С КАК Пользователь1С,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере = ИСТИНА КАК ЭтоСерверныйСертификат,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период КАК ДатаЗаписи,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр КАК ДопПараметр,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат КАК Сертификат,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.ОтпечатокСертификата КАК ОтпечатокСертификата,
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.ПустаяСсылка)
	|			ТОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Фамилия
	|		ИНАЧЕ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.Фамилия
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.ПустаяСсылка)
	|			ТОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Имя
	|		ИНАЧЕ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.Имя
	|	КОНЕЦ КАК Имя,
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.ПустаяСсылка)
	|			ТОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Отчество
	|		ИНАЧЕ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.Отчество
	|	КОНЕЦ КАК Отчество,
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.ПустаяСсылка)
	|			ТОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Должность
	|		ИНАЧЕ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.Должность
	|	КОНЕЦ КАК Должность,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия КАК СрокДействия,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.ПометкаУдаления КАК ПометкаУдаленияСертификат,        
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД КАК МЧДСсылка,
	|	ЕСТЬNULL(КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ИдентификаторДоверенности, """") КАК МЧД,
	|	ЕСТЬNULL(КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.СистемаХранения, """") КАК ИдСистХран,	
	|	ЕСТЬNULL(КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыпускаМЧД,
	|	ЕСТЬNULL(КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияМЧД,
	|	ЕСТЬNULL(КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ПроверятьПолномочия, Ложь) КАК ПроверятьПолномочия,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки КАК СтатусПроверки,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДатаПроверки КАК ДатаПроверки,
	|	ЕСТЬNULL(КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ПометкаУдаления, Ложь) КАК ПометкаУдаленияМЧД,
	|	РАЗНОСТЬДАТ(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДатаПроверки, &ДатаПодписания, ДЕНЬ) КАК ДнейПослеПроверкиМЧД,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер КАК СвДоверБум_ДатаДовер,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер КАК СвДоверБум_ВнНомДовер,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопСведенияОПодписанте КАК ДопСведенияОПодписанте,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий КАК ОбщийСпособПодтвержденияПолномочий,
	|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов КАК ИсключениеДляОтдельныхДокументов
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних(
	|			&ДатаПодписания,
	|			(ОрганизацияДиадок = &ОрганизацияДиадок
	|				ИЛИ ОрганизацияДиадок = &ПустаяОрганизацияДиадок)
	|				И (ДопПараметр = &ДопПараметр
	|					ИЛИ &ДопПараметр = НЕОПРЕДЕЛЕНО)) КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
	|ГДЕ
	|	(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок = &ОрганизацияДиадок
	|			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок = &ПустаяОрганизацияДиадок)
	|	И (КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &Пользователь1С
	|			ИЛИ &ПользовательНеУказан
	|			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = НЕОПРЕДЕЛЕНО
	|			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &ПустойПользователь1С)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОрганизацияДиадок УБЫВ,
	|	Пользователь1С УБЫВ";
		
	ЗаполнитьПараметрыЗапроса(ДатаПодписи, Запрос, ОрганизацияДиадок, Пользователь1С, ТекущийДопПараметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ОтправительЛОП = Ложь;
	Если ТипЗнч(ДокументОбъектИлиСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1")
		Или ТипЗнч(ДокументОбъектИлиСсылка) = Тип("ДокументОбъект.КонтурЛогистика_ТрН_Титул1") Тогда
		
		ОтправительЛОП = ДокументОбъектИлиСсылка.ДокументЭТРН.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку;
		
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		СтатусПодписанта = КонтурЛогистика_ОбработкаДокументовСервер.ОпределитьСтатусПодписанта(Выборка.ОбщийСпособПодтвержденияПолномочий,
																								ОтправительЛОП);
		СпосПодтПолном = КонтурЛогистика_ОбработкаДокументовСервер.ОпределитьСпосПодтПолном(Выборка.ОбщийСпособПодтвержденияПолномочий,
																							Выборка.ИсключениеДляОтдельныхДокументов);
		Если ЗначениеЗаполнено(СтатусПодписанта) Тогда
			Результат.СтатусПодписанта = Перечисления.КонтурЛогистика_СтатусыПодписанта.ЗначениеДляXDTO(СтатусПодписанта);
		КонецЕсли;
		Если ЗначениеЗаполнено(СпосПодтПолном) Тогда
			Результат.СпосПодтПолном = Перечисления.КонтурЛогистика_СпособыПодтвержденияПолномочий.ЗначениеДляXDTO(СпосПодтПолном);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МанифестПодписант() Экспорт
	
	Подписант = Новый Структура;
	Подписант.Вставить("СтатусПодписанта", 					Неопределено);
	Подписант.Вставить("СпосПодтПолном", 					Неопределено);
	Подписант.Вставить("Должность", 						"");
	Подписант.Вставить("Фамилия", 							"");
	Подписант.Вставить("Имя", 								"");
	Подписант.Вставить("Отчество", 							"");
	Подписант.Вставить("ОтпечатокСертификата", 				"");
	Подписант.Вставить("ИдСистХран", 						"");
	Подписант.Вставить("МЧД", 								"");
	Подписант.Вставить("ДатаВыпускаМЧД", 					Дата(1, 1, 1, 0, 0, 0));
	Подписант.Вставить("ДатаОкончанияМЧД", 					Дата(1, 1, 1, 0, 0, 0));
	Подписант.Вставить("ЭтоСерверныйСертификат", 			Ложь);
	Подписант.Вставить("ДатаЗаписи", 						Дата(1, 1, 1, 0, 0, 0));
	Подписант.Вставить("СвДоверБум_ДатаДовер", 				Дата(1, 1, 1, 0, 0, 0));
	Подписант.Вставить("СвДоверБум_ВнНомДовер", 			"");
	Подписант.Вставить("СрокДействия", 						Дата(1, 1, 1, 0, 0, 0));
	Подписант.Вставить("Пользователь1С", 					Неопределено);
	Подписант.Вставить("ДопПараметр", 						"");
	Подписант.Вставить("ПометкаУдаленияСертификат", 		Неопределено);
	Подписант.Вставить("ПометкаУдаленияМЧД", 				Неопределено);
	Подписант.Вставить("Сертификат", 						Неопределено);
	Подписант.Вставить("МЧДСсылка",							Неопределено);
	Подписант.Вставить("ДнейПослеПроверкиМЧД", 				0);
	Подписант.Вставить("СтатусПроверки", 					"");
	Подписант.Вставить("ПроверятьПолномочия", 				Ложь);
	Подписант.Вставить("ДопСведенияОПодписанте", 			"");
	Подписант.Вставить("ОбщийСпособПодтвержденияПолномочий",Неопределено);
	Подписант.Вставить("ИсключениеДляОтдельныхДокументов",	Неопределено);
	
	Возврат  Подписант;
	
КонецФункции

Функция ПодписыватьНаСервере(ОрганизацияДиадок, Пользователь1С, ДатаПодписи = Неопределено) Экспорт
	
	Если ДатаПодписи = Неопределено Тогда
		
		ДатаПодписи = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере КАК СертификатНаСервере
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних(
	               |			&ДатаПодписания,
	               |			ОрганизацияДиадок = &ОрганизацияДиадок
	               |				ИЛИ ОрганизацияДиадок = &ПустаяОрганизацияДиадок) КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
	               |ГДЕ
	               |	(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок = &ОрганизацияДиадок
	               |			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок = &ПустаяОрганизацияДиадок)
	               |	И (КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &Пользователь1С
	               |			ИЛИ &ПользовательНеУказан
	               |			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = Неопределено
	               |			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &ПустойПользователь1С)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С УБЫВ";
	
	ЗаполнитьПараметрыЗапроса(ДатаПодписи, Запрос, ОрганизацияДиадок, Пользователь1С);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.СертификатНаСервере;
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;

КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(Знач ДатаПодписи, Знач Запрос, Знач ОрганизацияДиадок, Знач Пользователь1С, Знач ДопПараметр = Неопределено)
	
	ИмяСправочникаПользователи = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяСправочникаПользователи");
	Если Не ЗначениеЗаполнено(ИмяСправочникаПользователи) Тогда
		ВызватьИсключение "Не заполнена основная настройка ""Имя справочника Пользователи"""
			+ " (Служебные настройки - Особенности хранения данных типовой конфигурации - Имя справочника Пользователи)";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДопПараметр", 			ДопПараметр);
	Запрос.УстановитьПараметр("ДатаПодписания", 		ДатаПодписи);
	Запрос.УстановитьПараметр("ОрганизацияДиадок", 		ОрганизацияДиадок);
	Запрос.УстановитьПараметр("ПустаяОрганизацияДиадок",Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПользовательНеУказан",	Пользователь1С = Неопределено);
	Запрос.УстановитьПараметр("ПустойПользователь1С",	Справочники[ИмяСправочникаПользователи].ПустаяСсылка());
	Запрос.УстановитьПараметр("Пользователь1С", 		Пользователь1С);

КонецПроцедуры

Функция ДанныеСертификатаДляПодписания(ОрганизацияДиадок, Пользователь1С = Неопределено, ДатаПодписи = Неопределено,
	ИспользоватьТолькоСерверные = Ложь, ДокументОбъектИлиСсылка = Неопределено, Знач ДопПараметр = Неопределено) Экспорт
	
	Результат = Новый Структура("Отпечаток, СертификатНаСервере, СрокДействия, Представление");
		
	Если ДатаПодписи = Неопределено Тогда
		
		ДатаПодписи = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	// Кастомизировать особенности выбора сертификата через ПМ:
	// установить ДопПараметр равный тому что в регистре КонтурЛогистика_НастройкиПодписания
	ДопПараметрПМ = КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ВыбратьПодписанта_ДопПараметр",
		Истина,
		ДокументОбъектИлиСсылка);
	
	Если ЗначениеЗаполнено(ДопПараметрПМ) Тогда
		ДопПараметр = ДопПараметрПМ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат КАК СертификатСсылка,
	               |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.ОтпечатокСертификата КАК ОтпечатокСертификата,
				   |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.ТипМодуляКриптографии КАК ТипМодуляКриптографии,
				   |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.ИмяМодуляКриптографии КАК ИмяМодуляКриптографии,
	               |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере КАК СертификатНаСервере,
	               |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия КАК СрокДействия,
				   |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.ВводитьПарольВПрограммеЭлектроннойПодписи КАК ВводитьПарольВПрограммеЭлектроннойПодписи,
	               |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.Представление КАК Представление
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних(
	               |			&ДатаПодписания,
	               |			(ОрганизацияДиадок = &ОрганизацияДиадок
	               |				ИЛИ ОрганизацияДиадок = &ПустаяОрганизацияДиадок)
	               |			И (ДопПараметр = &ДопПараметр
	               |				ИЛИ &ДопПараметр = НЕОПРЕДЕЛЕНО)
				   |			И (&ИспользоватьТолькоСерверные = ЛОЖЬ
	               |				ИЛИ СертификатНаСервере)) КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
	               |ГДЕ
	               |	(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок = &ОрганизацияДиадок
	               |			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок = &ПустаяОрганизацияДиадок)
	               |	И (КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &Пользователь1С
	               |			ИЛИ &ПользовательНеУказан
	               |			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = Неопределено
	               |			ИЛИ КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &ПустойПользователь1С)
				   |    И Не КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С УБЫВ";
	
	ЗаполнитьПараметрыЗапроса(ДатаПодписи, Запрос, ОрганизацияДиадок, Пользователь1С, ДопПараметр);
	Запрос.УстановитьПараметр("ИспользоватьТолькоСерверные", ИспользоватьТолькоСерверные);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат.Вставить("СертификатСсылка", Выборка.СертификатСсылка);
		Результат.Вставить("Отпечаток", Выборка.ОтпечатокСертификата);
		Результат.Вставить("ТипМодуляКриптографии", Выборка.ТипМодуляКриптографии);
		Результат.Вставить("ИмяМодуляКриптографии", Выборка.ИмяМодуляКриптографии);
		Результат.Вставить("СертификатНаСервере", Выборка.СертификатНаСервере);
		Результат.Вставить("СрокДействия", Выборка.СрокДействия);
		Результат.Вставить("ВводитьПарольВПрограммеЭлектроннойПодписи", Выборка.ВводитьПарольВПрограммеЭлектроннойПодписи);
		Результат.Вставить("Представление", Выборка.Представление);
		
	Иначе
		Сообщить("Для организации " + ОрганизацияДиадок + " по пользователю: " + Пользователь1С + " не могу найти на дату " + ДатаПодписи + " настройку подписания " + ?(ИспользоватьТолькоСерверные, " НА СЕРВЕРЕ", ""));
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

Функция ОрганизацияДляПолученияНастроекПодписания(ДокументЭТрНСсылка) Экспорт 
	
	ПогрузкуОсуществляетДругаяОрганизация = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПогрузкуОсуществляетДругаяОрганизация(ДокументЭТрНСсылка);
	
	Если ПогрузкуОсуществляетДругаяОрганизация 
		И ДокументЭТрНСсылка.ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку Тогда 
		
		Организация = ДокументЭТрНСсылка.ПогрузкуОсуществляет;
		
	Иначе
		
		Организация = ДокументЭТрНСсылка.Грузоотправитель;
		
	КонецЕсли;				
	
	Возврат Организация;
	
КонецФункции

Функция ПолучитьПредставлениеСертификата(ДанныеСертификата) Экспорт
	
	Представление = Новый Массив;
	
	Если ДанныеСертификата.Свойство("Пользователь1С") Тогда
		Представление.Добавить(ДанныеСертификата.Пользователь1С);	
	КонецЕсли;
	Если ДанныеСертификата.Свойство("ОрганизацияДиадок") Тогда
		Представление.Добавить(ДанныеСертификата.ОрганизацияДиадок);	
	КонецЕсли;
	Если ДанныеСертификата.Свойство("СрокДействия") Тогда
		Представление.Добавить(Формат(ДанныеСертификата.СрокДействия, "ДФ=dd.MM.yyyy"));	
	КонецЕсли;
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Представление, ", ")
	
КонецФункции

Функция СертификатыДляПроверки(Пользователь1С, ТекПользовательЯвляетсяАдминистратором) Экспорт
	
	тзСертификаты = Новый ТаблицаЗначений;
	тзСертификаты.Колонки.Добавить("Сертификат");
	
	тзМЧД = Новый ТаблицаЗначений;
	тзМЧД.Колонки.Добавить("МЧД");
	
	тзПроверкаМЧД = Новый ТаблицаЗначений;
	тзПроверкаМЧД.Колонки.Добавить("МЧД");
	
	ДЗ = ИнициализироватьДеревоЗначенийСертификатовДляПроверки();
	
	ЗаполненДопПараметр = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =		
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок КАК ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С КАК Пользователь,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ) КАК КолвоДнейСертификат,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ) КАК КолвоДнейМЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД КАК МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период КАК Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат КАК Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере КАК СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер КАК СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер КАК СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр КАК ДопПараметр,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МЧДНеПрошлаПроверку,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СертификатБезМЧД,
		|	КОЛИЧЕСТВО(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок) КАК КолвоОрг,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий КАК ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов КАК ИсключениеДляОтдельныхДокументов
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
		|ГДЕ
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ) <= 30
		|	И (КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &Пользователь1С
		|			ИЛИ &БезФильтраПользователь1С)
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ),
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ),
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ),
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	КОЛИЧЕСТВО(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок),
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
		|ГДЕ
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ) <= 30
		|	И (КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &Пользователь1С
		|			ИЛИ &БезФильтраПользователь1С)
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ),
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ),
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ),
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	КОЛИЧЕСТВО(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок),
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
		|ГДЕ
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|	И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|	И (КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С = &Пользователь1С
		|			ИЛИ &БезФильтраПользователь1С)
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ),
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ),
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ),
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	КОЛИЧЕСТВО(КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок),
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних
		|ГДЕ
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатБезМЧД
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Пользователь1С,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Период,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ДатаДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.СвДоверБум_ВнНомДовер,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ДопПараметр,
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СрокДействия, ДЕНЬ),
		|	РАЗНОСТЬДАТ(&ТекДата, КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД.ДатаОкончания, ДЕНЬ),
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> ""IsValid""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.СтатусПроверки <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОбщийСпособПодтвержденияПолномочий,
		|	КонтурЛогистика_НастройкиПодписанияСрезПоследних.ИсключениеДляОтдельныхДокументов,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_НастройкиПодписанияСрезПоследних.Сертификат.СертификатВыдан = ""ФЛ""
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ФизЛицо)
		|				И КонтурЛогистика_НастройкиПодписанияСрезПоследних.ОрганизацияДиадок.ТипЛица <> ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛиц.ИП)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИТОГИ ПО
		|	Сертификат,
		|	МЧД,
		|	ДопПараметр";
	 	
	Запрос.УстановитьПараметр("БезФильтраПользователь1С", ТекПользовательЯвляетсяАдминистратором);
	Запрос.УстановитьПараметр("Пользователь1С", Пользователь1С);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОтпечатокСертификата = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОтпечатокСертификата.Следующий() Цикл
								
		ВыборкаМЧД = ВыборкаОтпечатокСертификата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаМЧД.Следующий() Цикл
					
			ВыборкаДопПараметр = ВыборкаМЧД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаДопПараметр.Следующий() Цикл
				
				СтрокаСертификат = ДЗ.Строки.Добавить();
				
				ПервыйВЦикле = Истина;
				
				Если Не ЗаполненДопПараметр Тогда 
					ЗаполненДопПараметр = ЗначениеЗаполнено(ВыборкаДопПараметр.ДопПараметр);
				КонецЕсли;
				
				ВыборкаДетальныеЗаписи = ВыборкаДопПараметр.Выбрать();	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ПервыйВЦикле Тогда
						
						СтрокаСертификат.Действия = "Заменить";
						
						СертификатИстек = Ложь;
						СертификатИстекает = Ложь;
						МЧДИстекла = Ложь;
						МЧДИстекает = Ложь;
												
						ЗаполнитьЗначенияСвойств(СтрокаСертификат, ВыборкаДетальныеЗаписи);
						
						СтрокаСертификат.ОрганизацияСтрока = ВыборкаДетальныеЗаписи.ОрганизацияДиадок;
																		
						Если ВыборкаДетальныеЗаписи.КолвоДнейСертификат < 0 Тогда			
							СтрокаСертификат.ОписаниеПредупрежденияСертификат = "Истек";
							СтрокаСертификат.СостояниеСертификата = "Истек";
							СертификатИстек = Истина;
						ИначеЕсли ВыборкаДетальныеЗаписи.КолвоДнейСертификат = 0 Тогда			
							СтрокаСертификат.ОписаниеПредупрежденияСертификат = "Сегодня истекает";
							СтрокаСертификат.СостояниеСертификата = "Истекает";
							СертификатИстекает = Истина;
						ИначеЕсли ВыборкаДетальныеЗаписи.КолвоДнейСертификат <= 30 Тогда					
							СтрокаСертификат.ОписаниеПредупрежденияСертификат = "Через " + Строка(ВыборкаДетальныеЗаписи.КолвоДнейСертификат) + " дней";					
							СтрокаСертификат.СостояниеСертификата = "Истекает";
							СертификатИстекает = Истина;
						КонецЕсли;
						
						Если Не ВыборкаДетальныеЗаписи.МЧД.Пустая() И ВыборкаДетальныеЗаписи.КолвоДнейМЧД < 0 Тогда			
							СтрокаСертификат.ОписаниеПредупрежденияМЧД = "Истекла";
							СтрокаСертификат.СостояниеМЧД = "Истекла";
							МЧДИстекла = Истина;
						ИначеЕсли Не ВыборкаДетальныеЗаписи.МЧД.Пустая() И ВыборкаДетальныеЗаписи.КолвоДнейМЧД = 0 Тогда			
							СтрокаСертификат.ОписаниеПредупрежденияМЧД = "Сегодня истекает";
							СтрокаСертификат.СостояниеМЧД = "Истекает";
							МЧДИстекает = Истина;
						ИначеЕсли Не ВыборкаДетальныеЗаписи.МЧД.Пустая() И ВыборкаДетальныеЗаписи.КолвоДнейМЧД <= 30 Тогда					
							СтрокаСертификат.ОписаниеПредупрежденияМЧД = "Через " + Строка(ВыборкаДетальныеЗаписи.КолвоДнейМЧД) + " дней";					
							СтрокаСертификат.СостояниеМЧД = "Истекает";
							ПоказатьДействияМЧД = Истина;
							МЧДИстекает = Истина;
						ИначеЕсли Не ВыборкаДетальныеЗаписи.МЧД.Пустая() И ВыборкаДетальныеЗаписи.МЧДНеПрошлаПроверку Тогда					
							СтрокаСертификат.ОписаниеПредупрежденияМЧД = "МЧД не прошла проверку";					
							СтрокаСертификат.СостояниеМЧД = "МЧД не прошла проверку";
							СтрокаСертификат.Действия = "Проверить";
						ИначеЕсли ВыборкаДетальныеЗаписи.МЧД.Пустая() И ВыборкаДетальныеЗаписи.СертификатБезМЧД Тогда					
							СтрокаСертификат.ОписаниеПредупрежденияМЧД = "		Не выбрана МЧД";					
							СтрокаСертификат.СостояниеМЧД = "Не выбрана МЧД";
							СтрокаСертификат.Действия = "Проверить";
						КонецЕсли;
																				
						ФИО = ВыборкаДетальныеЗаписи.Сертификат.Фамилия + " " + ВыборкаДетальныеЗаписи.Сертификат.Имя + " " + ВыборкаДетальныеЗаписи.Сертификат.Отчество;
																
						СтрокаСертификат.КартинкаСертификата = 0; 
						СтрокаСертификат.КартинкаМЧД = ?(ВыборкаДетальныеЗаписи.МЧД.Пустая(), 1, 0);
						
						Если СертификатИстек Или СертификатИстекает Тогда
							НовыйСертификат = тзСертификаты.Добавить();
							НовыйСертификат.Сертификат = ВыборкаМЧД.Сертификат;
						КонецЕсли;
						Если МЧДИстекла Или МЧДИстекает Тогда
							НоваяМЧД = тзМЧД.Добавить();
							НоваяМЧД.МЧД = ВыборкаМЧД.МЧД;
						КонецЕсли;
						Если ВыборкаДетальныеЗаписи.МЧДНеПрошлаПроверку Или ВыборкаДетальныеЗаписи.СертификатБезМЧД Тогда
							НоваяМЧД = тзПроверкаМЧД.Добавить();
							НоваяМЧД.МЧД = ВыборкаМЧД.МЧД;
						КонецЕсли;
																		
					КонецЕсли;
					
					Если ВыборкаДопПараметр.КолвоОрг > 1 Тогда
						
						СтрокаСертификат.ОрганизацияСтрока = ПредставлениеОрганизации(ВыборкаДопПараметр.КолвоОрг);
						СтрокаСертификат.Пользователь = "";				
						
						СтрокаОрганизация = СтрокаСертификат.Строки.Добавить();
						СтрокаОрганизация.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
						СтрокаОрганизация.ОрганизацияСтрока = ВыборкаДетальныеЗаписи.ОрганизацияДиадок;
						СтрокаОрганизация.ОрганизацияДиадок = ВыборкаДетальныеЗаписи.ОрганизацияДиадок;
						СтрокаОрганизация.Период = ВыборкаДетальныеЗаписи.Период;
						СтрокаОрганизация.СертификатНаСервере = ВыборкаДетальныеЗаписи.СертификатНаСервере;
						СтрокаОрганизация.КартинкаСертификата = 1;
						СтрокаОрганизация.КартинкаМЧД = 1;						
												
					КонецЕсли;
																	
					ПервыйВЦикле = Ложь;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	тзСертификаты.Свернуть("Сертификат");
	тзМЧД.Свернуть("МЧД");
	тзПроверкаМЧД.Свернуть("МЧД");
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаполненДопПараметр", ЗаполненДопПараметр);
	Результат.Вставить("СертификатыДЗ", ДЗ);
	Результат.Вставить("КолвоПроблемныхСертификатов", тзСертификаты.Количество());
	Результат.Вставить("КолвоПроблемныхМЧД", тзМЧД.Количество());
	Результат.Вставить("КолвоНеПрошедшихПроверкуМЧД", тзПроверкаМЧД.Количество());
	
	Возврат Результат;	
	
КонецФункции

Функция ИнициализироватьДеревоЗначенийСертификатовДляПроверки()
	
	ДЗ = Новый ДеревоЗначений;
	ДЗ.Колонки.Добавить("ОрганизацияДиадок");
	ДЗ.Колонки.Добавить("ОрганизацияСтрока");
	ДЗ.Колонки.Добавить("Пользователь");
	ДЗ.Колонки.Добавить("КолвоДнейСертификат");
	ДЗ.Колонки.Добавить("КолвоДнейМЧД");
	ДЗ.Колонки.Добавить("СертификатНаСервере");
	ДЗ.Колонки.Добавить("Сертификат");
	ДЗ.Колонки.Добавить("МЧД");
	ДЗ.Колонки.Добавить("ОписаниеПредупрежденияСертификат");
	ДЗ.Колонки.Добавить("ОписаниеПредупрежденияМЧД");
	ДЗ.Колонки.Добавить("Действия");
	ДЗ.Колонки.Добавить("СостояниеСертификата");
	ДЗ.Колонки.Добавить("СостояниеМЧД");
	ДЗ.Колонки.Добавить("Период");
	ДЗ.Колонки.Добавить("КартинкаСертификата");
	ДЗ.Колонки.Добавить("КартинкаМЧД");
	ДЗ.Колонки.Добавить("ДопПараметр");
	ДЗ.Колонки.Добавить("СертификатБезМЧД");
	ДЗ.Колонки.Добавить("МЧДНеПрошлаПроверку");
	
	Возврат ДЗ;
	
КонецФункции

Функция ПредставлениеОрганизации(Колво)
	
	Представление = "[ " + Строка(Колво);
	
	Если Колво = 2 ИЛИ Колво = 3 ИЛИ Колво = 4 Тогда
		Представление = Представление + " организации ]";
	Иначе
		Представление = Представление + " организаций ]";
	КонецЕсли;		
	
	Возврат Представление;
	
КонецФункции

Функция ПеременныеМетрикаНастройкиПодписания(Знач Настройка) Экспорт
	
	Если Настройка.ОбщийСпособПодтвержденияПолномочий = Перечисления.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий.МЧД Тогда
		СпособПодтвержденияПолномочий = "МЧД";
	Иначе
		СпособПодтвержденияПолномочий = Строка(Настройка.ОбщийСпособПодтвержденияПолномочий);
	КонецЕсли;
	
	Переменные = Новый Структура;
	Переменные.Вставить("BoxID", Настройка.ОрганизацияДиадок.ID);
	Переменные.Вставить("СпособПодтвержденияПолномочий", СпособПодтвержденияПолномочий);
	Переменные.Вставить("ИсключениеДляОтдельныхДокументов", Настройка.ИсключениеДляОтдельныхДокументов);
	Переменные.Вставить("БудуОтправлятьНеподписанные", Не ЗначениеЗаполнено(Настройка.Сертификат));
	Переменные.Вставить("ЗаполненыДопСведенияОПодписанте", Не Настройка.ДопСведенияОПодписанте = "");
	Переменные.Вставить("ИдентификаторНастройки", Настройка.ИдентификаторНастройки);
	
	Возврат Переменные;
	
КонецФункции

Функция КоличествоДействующихНастроекПодписания() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	     "ВЫБРАТЬ
		 |	КонтурЛогистика_НастройкиПодписания.ОрганизацияДиадок КАК ОрганизацияДиадок,
		 |	КонтурЛогистика_НастройкиПодписания.Пользователь1С КАК Пользователь1С,
		 |	КонтурЛогистика_НастройкиПодписания.СертификатНаСервере КАК СертификатНаСервере,
		 |	КонтурЛогистика_НастройкиПодписания.ДопПараметр КАК ДопПараметр,
		 |	КонтурЛогистика_НастройкиПодписания.МЧД КАК МЧД,
		 |	КонтурЛогистика_НастройкиПодписания.МЧД.ДатаОкончания КАК МЧДДатаОкончания
		 |ИЗ
		 |	РегистрСведений.КонтурЛогистика_НастройкиПодписания КАК КонтурЛогистика_НастройкиПодписания
		 |ГДЕ
		 |	НЕ КонтурЛогистика_НастройкиПодписания.ОрганизацияДиадок.ПометкаУдаления
		 |	И КонтурЛогистика_НастройкиПодписания.ОрганизацияДиадок.Наш
		 |	И КонтурЛогистика_НастройкиПодписания.Сертификат.СрокДействия >= &ТекущаяДата
		 |	И (КонтурЛогистика_НастройкиПодписания.МЧД = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_МЧД.ПустаяСсылка)
		 |			ИЛИ КонтурЛогистика_НастройкиПодписания.МЧД.ДатаОкончания >= &ТекущаяДата)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество();
	
КонецФункции

#КонецЕсли
